<template>
  <div class="flex flex-col gap-4">
    <template v-if="!isLoggedIn">
      <h3 class="text-[3em] font-bold ">
        Добро пожвловать на <span class="text-primary">Мой Сам!</span>
      </h3>

      <p>
        Кампания «Мой Не Сам» — это профессиональный сервис уборки жилых и производственных помещений, который избавляет
        вас от хлопот, связанных с наведением порядка.
        <br>
        Мы берем на себя всю рутинную работу: от ежедневной поддержки чистоты до генеральной уборки и клининга после
        ремонта. Наша команда использует современное оборудование и экологичные средства, чтобы обеспечить безупречный
        результат без вашего участия.
        <br>

        С «Мой Не Сам» вам не придется тратить время и силы на уборку — просто наслаждайтесь чистотой и комфортом! 🧹✨
      </p>

      <Button v-slot="slotProps" as-child>
        <RouterLink class="mt-10" to="/auth/login" :class="slotProps.class">
          Стать нашим клиентом!
        </RouterLink>
      </Button>
    </template>
  </div>
</template>

<script lang="ts" setup>
definePageMeta({ auth: false })
const { isLoggedIn } = useAppAuth()
</script>

<style scoped>
pre {
  @apply bg-gray-800 text-white p-3 my-3 rounded shadow overflow-x-auto;
}

pre span {
  @apply text-green-400;
}
</style>
